{
    "header": {
        "name":"Sam Sterns",
        "title":"Software Developer"
      },
    "profile": {
      "profileStatement":"I believe technology is a tool to build equity, which is why I focus on creating inclusive, impactful, and maintainable digital products. I will bring authenticity and agility to your engineering team."
    },
    "contacts": {
        "portfolio":"sam.g.sterns.com",
        "github":"/samSterns",
        "linkedIn":"/samsterns"
    },
    "techSkill":{
      "practices":"TDD, DDD, WCAG",
      "tools":"Heroku, GitHub, Webpack, Kaban, PgAdmin, Postman, Strata, AdobeXd",
      "databases":"PostgresSQL, MongoDB",
      "languages":"HTML/CSS, JavaScript",
      "libraries":"Chart.js, Mongoose",
      "testing":"Jest, QUnit, Enzyme",
      "frameworks":"Node.js, Express, React.js, Redux"
    },
    "projectFTM":{
      "imageP":"https://drive.google.com/file/d/1bo4zCV1w54m5i0A8LnGCVWky63BgNTGf/view",
      "header":"Follow the Money",
      "subheader":"JavaScript, CSS, HTML",
      "description":"The mobile-first App fetches from the Federal Election Commissions API to provide current and customizable data visualizations via Sankey graphs. The accessibility is increased by the interactive mirco-copy and clean design.",
      "siteURL":"https://administrative-error.herokuapp.com/main/main.html",
      "githubURL":"https://github.com/administrativeError/campaign-project"
    }, 
    "projectPetPals":{
      "header":"Pet Pals",
      "subheader":"React.js,  Redux, Sass, Socket.io, MongoDB, Mongoose, NPM, Node.js, Express, AWS S3, Jest, Superagent",
      "description":"Share the responsibility of letting your dog out with a neighbor by creating a profile and searching for other pet owners near you. The app provides detailed profiles with profile pictures stored in AWS S3, real time messaging using socket.io, location sharing by accessing API, and suggestions of local places to meet. 5 day sprint with a team of 5 developers.",
      "siteURL":"https://pet-pals.netlify.com",
      "githubURL":"https://github.com/Pet-Project-Alchemy"
    }, 
    "projectCovrLettr":{
      "header":"Covr Lettr",
      "subheader":"MongoDB, Mongoose, NPM, Node.js, Express, Natural Language Processing, Jest, Superagent",
      "description":"The cover letters are populated with a user's job specific details. Then, a natural language processing sentiment analysis scores over a million variations of letters, and outputs the highest scoring one. 4 day sprint with 4 teammates",
      "siteURL":"https://github.com/covrLettr/covrLettr",
      "githubURL":"https://github.com/covrLettr/covrLettr"
    }, 
    "projectLyricus":{
      "imageP":"https://drive.google.com/open?id=1t9klpglsE6aNBs8_5P6VxGZVJvmqHoN3",
      "header":"Lyricus",
      "subheader":"React.js, Redux, NPM, Node.js, Express, Jest, Superagent, Material-UI",
      "description":"Utilizes React Hooks to fetch musical artists and lyrics. The design is WCAG AA compliant and uses minimalist illustration with UX features like pagination and breadcrumbs.",
      "siteURL":"https://romantic-lalande-b6c8a5.netlify.com/",
      "githubURL":"https://github.com/samSterns/lyricus-"
    },
    "experienceItem1":{
      "header":"Alchemy Code Lab",
      "subheader":"Intensive Software Engineer Program 2020",
      "description":"Undertook a rigorous full-stack professional training focusing on clean code and collaboration. I developed on teams and solo to build server-side and client-side applications, using architectures and frameworks that promote maintainability, scalability, and collaboration."
    },
    "experienceItem2":{
      "header":"University of California Berkeley",
      "subheader":"Bachelor of Arts in Interdisciplinary Studies, 2017 Graduated Magna Cum Laude",
      "description":"Mastered independently designed coursework focused on education, social research, human rights, & statistics to examine school discipline reform. I authored two years of original research working as a Restorative Justice Councilor in public schools where I implemented original curriculum, facilitated conflict resolution, and trained faculty. The quantitative data from my thesis informed statewide policy. "
    },
    "ExperienceItem3":{
      "header":"Restorative Justice Consultant",
      "subheader":"Independent Consultant",
      "description":"I founded the consultancy because I wanted to contribute to my community as a restorative justice counselor. I grew the business from word of mouth as I facilitated groups of professionals to build community. We confronted difficult topics including diversity, equity, & inclusion. I created long term action plans. I coached conflict resolution techniques and mediated conflicts, all while I developed the ability to navigate high-stress situations with composure."
    },
    "ExperienceItem4":{
      "header":"Project Research Lead",
      "subheader":"Sustainabilist, part-time, 2017 - 2019",
      "description":"Consulted closely with engineers and data scientists at the tech start-up which makes a new technology to improve the installation of solar panels. I used quantitative analysis skills to make detailed reports that synthesized market research, compiled data analytics, and organized logistics with clients. ------ A growth mindset and expertise in restorative conflict resolution inform my passion for solving people-centered problems with innovative solutions. "
    }


}
